/*
 * 프로그램 순서
 * 데이터 저장 -> 저장된 데이터 가공 -> 화면 출력
 * 
 * 데이터 저장
 *
 *   1)변수 : 데이터 한개 저장
 *           한개의 데이터를 저장할 때 메모리 크기 결정됨 => 기본형(데이터형/자료형)
 *   2)배열 : 같은 데이터 여러개 저장
 *  => 일차원 배열
 *  
 *   3)클래스: 다른 데이터 여러개 저장
 *           -> 사용자 정의 데이터
 *    
 *           
 *           
 *           
 *           
 *           
 *  데이터 가공 
 *   연상자
 *   
 *   제어문
 *   
 *  화면 출력
 *  System.out.print()
 *  System.out.printf()
 *  System.out.println()     
 *  
 *       
 *       
 *  정수
 *  byte
 *  int
 *  long
 *  -> 컴퓨터는 모든 정수를 int로 인식을 함
 *     int 와 long을 구분할 때는 L(1)을 사용 
 *  
 *  실수
 *  double
 *  
 *  논리
 *  boolean
 *  
 *  문자
 *  char
 *  
 *  
 *  문자열 : char 여러개 묶어서 사용 / 웹이나 네트워크는 모든 데이터가 문자열이다
 *  String : char[] -> 기능을 갖고 있음
 *         데이터 형 + 클래스형
 *         
 *         
 *         
 * 변수명 설정(식별자) : 메소드 , 클래스, 인터페이스 사용
 *                   알파벳, 한글로 시작 / 대소문자 구분해야함
 *                   숫자 사용이 가능(앞에서 사용금지)
 *                   키워드 사용 불가능(자바에서 사용되는 단어) -> 색상이 빨간색은 예약어
 *                   공백을 포함할 수 없음
 *                   특수문자 사용 _ , $
 *                   
 * 
 * 약속
 * 클래스/인터페이스는 대문자로 시작
 * 메소드/변수는 소문자로 시작
 * 상수는 모두 대문자로 시작
 * 단어가 2개 이상 -> 시작단어 대문자로 MainClass , FileName 등
 * 들여쓰기
 * 
 *  
 *  단항연산자
 *    형변환연산자
 *      1. int 이하 연산자(byte , char, short) -> 연산결과는 int
 *      
 *      
 *  논리연산자
 *    && : 직렬연결 (데이터 한쪽에서 들어옴)
 *    
 *    || : 병렬연결 (데이터가 양쪽에서 들어온다)
 *    
 *    
 *    
 *    
 * 제어문
 *  조건문
 *    단일조건문
 *    선택조건문
 *    다중 조건문
 *  선택문 
 *    swith
 *  반복문
 *    for
 *    while
 *    do~while
 *  반복제어문
 *    break
 *    continue   
 *  
 *          
 */
public class 정리1_4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}