package com.sist.main;
// p.295
/*
 * 클래스 : 설계-> 요구사항 분석을 한다
 * 객체 : 화면에 출력된 결과물
 * 캡슐화 : 접근 못하게 감추는 것(private) -> 필요할 때 노출가능(메소드를 이용)
 * 상속 : 공유할 수 있게 하는 것
 * 다형성 : 상황에 맞게 다르게 구현
 * 추상클래스 : 절반만 완성된 설계도 -> 미완성된 설계도 => 개발자로 책임을 넘김
 * 인터페이스 : 표준화 작업을 위한 규칙을 만들어서 처리
 * 내부클래스 : 공통변수 / 공통 메소드
 * ----------------------------------------------------------------
 * => 이러한 목적 : 쉽게 유지보수하기 위해
 *               추가 / 수정 / 재사용 가능하게 하기 위해
 * => 문법이 아니라 권장사항임
 * => 이런 개념이 면접에서 많이 나온다
 * --------------------------------------------------------------------
 *               
 */
public class 다형성_1 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
